demo_api/app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(comment_params)
		if @comment.save
---
INSERT INTO "comments" ("created_at", "updated_at", "commenter", "comment", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2023-02-21 12:02:04.821429"], ["updated_at", "2023-02-21 12:02:04.821429"], ["commenter", "test1"], ["comment", "This is a test comment"], ["user_id", 1], ["post_id", 4]]