demo_api/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Ruby"], ["body", "Ruby is a programming language"], ["created_at", "2023-02-21 05:56:44.003547"], ["updated_at", "2023-02-21 05:56:44.003547"], ["user_id", 2]]